Autodesk.Revit.DB.BoundingBoxXYZ.Enabled
Defines whether bounding box is turned on.

Autodesk.Revit.DB.BoundingBoxXYZ.BoundEnabled(System.Int32,System.Int32)
Indexed access for loops.
Remarks: For bound, use 0 for Min and 1 for Max. For dimension, use 0 for X, 1 for
Y and 2 for Z.
The entire box must be enabled to enable individual bounds.

Autodesk.Revit.DB.BoundingBoxXYZ.MaxEnabled(System.Int32)
Defines whether the maximum bound is active for given dimension.
Remarks: Use 0 for X, 1 for Y and 2 for Z.
The entire box must be enabled to enable individual bounds.

Autodesk.Revit.DB.BoundingBoxXYZ.MinEnabled(System.Int32)
Defines whether the minimum bound is active for given dimension.
Remarks: Use 0 for X, 1 for Y and 2 for Z.
The entire box must be enabled to enable individual bounds.

Autodesk.Revit.DB.BoundingBoxXYZ.Transform
The transform FROM the coordinate space of the box TO the model space.
Remarks: The transform must always be right-handed and orthonormal.

Autodesk.Revit.DB.BoundingBoxXYZ
A three-dimensional rectangular box.
Remarks: The box is defined as follows. A Transform specifies the coordinate system
in which the box is defined. The minimum and maximum values for each coordinate in
that system are specified.
An alternative way to construct the box is: for each basis vector of the transform,
there are two planes that are orthogonal to the vector and have their origins given
by Transform.Origin + BasisVector * Bound.
The entire box and each face may be turned on or off.